In [1]:
#import libraries
import numpy as np
import pandas as pd

In [2]:
#create dataframe
olympic_series_participation = pd.Series([205,204,201,200,197], index = [2012,2008,2004,2000,1996])
olympic_series_country = pd.Series(['London','Beiging','Athens','Sydney','Atlanta'], index = [2012,2008,2004,2000,1996])
df_olympic_series = pd.DataFrame({
    'No. of participating Countries':olympic_series_participation,
    'Host Cities': olympic_series_country
})

In [3]:
#display the content of the dataframe
df_olympic_series

      No. of participating Countries Host Cities
2012                             205      London
2008                             204     Beiging
2004                             201      Athens
2000                             200      Sydney
1996                             197     Atlanta

In [4]:
#view top 2 records
df_olympic_series.head(2)

      No. of participating Countries Host Cities
2012                             205      London
2008                             204     Beiging

In [5]:
#view last 3 records
df_olympic_series.tail(3)

      No. of participating Countries Host Cities
2004                             201      Athens
2000                             200      Sydney
1996                             197     Atlanta

In [6]:
#view dataframe describe
df_olympic_series.describe

<bound method NDFrame.describe of       No. of participating Countries Host Cities
2012                             205      London
2008                             204     Beiging
2004                             201      Athens
2000                             200      Sydney
1996                             197     Atlanta>

In [7]:
#view_index
df_olympic_series.index

Int64Index([2012, 2008, 2004, 2000, 1996], dtype='int64')

In [8]:
#view columns
df_olympic_series.columns

Index(['No. of participating Countries', 'Host Cities'], dtype='object')

### Select Data

In [14]:
#select data for host cities
df_olympic_series['Host Cities']

2012     London
2008    Beiging
2004     Athens
2000     Sydney
1996    Atlanta
Name: Host Cities, dtype: object

In [15]:
#select label location based access by label
df_olympic_series.loc[2012]

No. of participating Countries       205
Host Cities                       London
Name: 2012, dtype: object

In [16]:
#Integer-Location based indexing on position
df_olympic_series.iloc[0:2]

      No. of participating Countries Host Cities
2012                             205      London
2008                             204     Beiging

In [19]:
#Integer-Location based data selection by index value
df_olympic_series.iat[3,0]

200

In [20]:
#Select the data where the no of participated countries is more than 200
df_olympic_series[df_olympic_series['No. of participating Countries']>200]

      No. of participating Countries Host Cities
2012                             205      London
2008                             204     Beiging
2004                             201      Athens